#include "sys.h"
#include "delay.h"							//延时驱动文件
#include "server.h"							//舵机驱动文件

/*
	测试平台 STM32F103RCT6
	舵机棕色线 --> GND
	舵机红色线 --> 5V
	舵机橙色线 --> GPIO_Pin_6
*/

/************************************************************************************/
/*以下函数为360度舵机的正向转动、停止、反向转动的测试函数
	*	PWM 信号与360舵机转速的关系：
	*	0.5ms ---------------- 正向最大转速
	*	1.5ms ---------------- 速度为0
	*	2.5ms ---------------- 反向最大转速
 
	*	舵机频率与占空比的计算：
	*	设舵机的频率为50HZ，则PWM周期为20ms，0度对应的占空比为2.5%，即0.05ms的高电平输出。
 */
 
//360度舵机测试函数
void Server_360_Forward(void)
{
	TIM_SetCompare1(TIM8,5);//0.5ms --> 正向最大转速
	delay_ms(50000);
	
	TIM_SetCompare1(TIM8,15);//1.5ms --> 速度为0
	delay_ms(50000);
	
	TIM_SetCompare1(TIM8,25);//2.5ms --> 反向最大转速
	delay_ms(50000);
}
/*****************************************END****************************************/


/************************************************************************************/
/*以下函数为0-180度舵机角度控制测试函数
	*	PWM 信号与0-180舵机的关系：
	*	0.5ms ---------------- 0度
	*	1ms   ---------------- 45度
	*	1.5ms ---------------- 90度
	*	2ms   ---------------- 135度
	*	2.5ms ---------------- 180度
 
	*	舵机频率与占空比的计算：
	*	设舵机的频率为50HZ，则PWM周期为20ms，0度对应的占空比为2.5%，即0.05ms的高电平输出。
 */
 
//0-180度舵机 --> 0-90-180度控制函数
void Server_180_Angle(void)
{
	TIM_SetCompare1(TIM8,5);//0度
	delay_ms(1000);
	
	TIM_SetCompare1(TIM8,15);//90度
	delay_ms(1000);	
	
	TIM_SetCompare1(TIM8,25);//180度
	delay_ms(1000);	
}
/*****************************************END****************************************/


/* 主函数 */
int main(void)
{	
	delay_init();							//延时初始化
	TIM8_PWM_Init(); 					//舵机初始化             	 
	while(1)
	{  
		Server_180_Angle();//180度测试
	}
}
